ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U366.svd
        <register>
          <name>DAC_MCR</name>
          <displayName>DAC_MCR</displayName>
          <description>DAC mode control register </description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE1</name>
              <description>These bits can be written only when the DAC is disabled and not in the calibration mode (when bit EN1 = 0 and bit CEN1 = 0 in the DAC_CR register). If EN1 = 1 or CEN1 = 1 the write operation is ignored.
They can be set and cleared by software to select the DAC channel1 mode.
000: DAC channel1 in Normal mode is connected to external pin with Buffer enabled
001: DAC channel1 in Normal mode is connected to external pin and to on chip peripherals with buffer enabled
010: DAC channel1 in Normal mode is connected to external pin with buffer disabled
011: DAC channel1 in Normal mode is connected to on chip peripherals with Buffer disabled
100: DAC channel1 in Sample and hold mode is connected to external pin with Buffer enabled
101: DAC channel1 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer enabled
110: DAC channel1 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer disabled
111: DAC channel1 in Sample and hold mode is connected to on chip peripherals with Buffer disabled
Note: This register can be modified only when EN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DAC channel1 in Normal mode is connected to external pin with Buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DAC channel1 in Normal mode is connected to external pin and to on chip peripherals with buffer enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>DAC channel1 in Normal mode is connected to external pin with buffer disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>DAC channel1 in Normal mode is connected to on chip peripherals with Buffer disabled</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>DAC channel1 in Sample and hold mode is connected to external pin with Buffer enabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>DAC channel1 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer enabled</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>DAC channel1 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer disabled</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>DAC channel1 in Sample and hold mode is connected to on chip peripherals with Buffer disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADOUBLE1</name>
              <description>This bit is set and cleared by software.
0: DMA Normal mode selected
1: DMA Double data mode selected
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DMA Normal mode selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DMA Double data mode selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINFORMAT1</name>
              <description>This bit is set and cleared by software.
0: Input data is in unsigned format 
1: Input data is in signed format (2's complement). The MSB bit represents the sign.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Input data is in unsigned format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Input data is in signed format (2's complement). The MSB bit represents the sign.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFSEL</name>
              <description>None
00: High frequency interface mode disabled
01: High frequency interface mode compatible to AHB greater or equal 48 MHz enabled
10: Reserved
11: Reserved
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>High frequency interface mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>High frequency interface mode compatible to AHB greater or equal 48 MHz enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE2</name>
              <description>These bits can be written only when the DAC is disabled and not in the calibration mode (when bit EN2 = 0 and bit CEN2 = 0 in the DAC_CR register). If EN2 = 1 or CEN2 = 1 the write operation is ignored.
They can be set and cleared by software to select the DAC channel2 mode.
000: DAC channel2 in Normal mode is connected to external pin with Buffer enabled
001: DAC channel2 in Normal mode is connected to external pin and to on chip peripherals with buffer enabled
010: DAC channel2 in Normal mode is connected to external pin with buffer disabled
011: DAC channel2 in Normal mode is connected to on chip peripherals with Buffer disabled
100: DAC channel2 in Sample and hold mode is connected to external pin with Buffer enabled
101: DAC channel2 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer enabled
110: DAC channel2 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer disabled
111: DAC channel2 in Sample and hold mode is connected to on chip peripherals with Buffer disabled
Note: This register can be modified only when EN2 = 0.
Note: Refer to  less than xe1 [Implementation]/&gt; for the availability of DAC channel2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DAC channel2 in Normal mode is connected to external pin with Buffer enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DAC channel2 in Normal mode is connected to external pin and to on chip peripherals with buffer enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>DAC channel2 in Normal mode is connected to external pin with buffer disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>DAC channel2 in Normal mode is connected to on chip peripherals with Buffer disabled</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>DAC channel2 in Sample and hold mode is connected to external pin with Buffer enabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>DAC channel2 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer enabled</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>DAC channel2 in Sample and hold mode is connected to external pin and to on chip peripherals with Buffer disabled</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>DAC channel2 in Sample and hold mode is connected to on chip peripherals with Buffer disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADOUBLE2</name>
              <description>This bit is set and cleared by software.
0: DMA Normal mode selected
1: DMA Double data mode selected
Note: This bit is available only on dual-channel DACs. Refer to  less than xe1 [Implementation]/&gt;.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DMA Normal mode selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DMA Double data mode selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINFORMAT2</name>
              <description>This bit is set and cleared by software.
0: Input data is in unsigned format 
1: Input data is in signed format (2's complement). The MSB bit represents the sign.
Note: This bit is available only on dual-channel DACs. Refer to  less than xe1 [Implementation]/&gt;.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Input data is in unsigned format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Input data is in signed format (2's complement). The MSB bit represents the sign.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHSR1</name>
          <displayName>DAC_SHSR1</displayName>
          <description>DAC channel1 sample and hold sample time register	</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSAMPLE1</name>
              <description>These bits can be written when the DAC channel1 is disabled or also during normal operation. in the latter case, the write can be done only when BWST1 of DAC_SR register is low, If BWST1 = 1, the write operation is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHSR2</name>
          <displayName>DAC_SHSR2</displayName>
          <description>DAC channel2 sample and hold sample time register 	</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSAMPLE2</name>
              <description>These bits can be written when the DAC channel2 is disabled or also during normal operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHHR</name>
          <displayName>DAC_SHHR</displayName>
          <description>DAC sample and hold time register </description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THOLD1</name>
              <description>Hold time = (THOLD[9:0]) x LSI/LSE clock period
Note: This register can be modified only when EN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THOLD2</name>
              <description>Hold time = (THOLD[9:0]) x LSI/LSE clock period
Note: This register can be modified only when EN2 = 0.
Note: These bits are available only on dual-channel DACs. Refer to  less than xe1 [Implementation]/&gt;.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHRR</name>
          <displayName>DAC_SHRR</displayName>
          <description>DAC sample and hold refresh time register </description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>Refresh time = (TREFRESH[7:0]) x LSI / LSE clock period
Note: This register can be modified only when EN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>Refresh time = (TREFRESH[7:0]) x LSI / LSE clock period
Note: This register can be modified only when EN2 = 0.
Note: These bits are available only on dual-channel DACs. Refer to  less than xe1 [Implementation]/&gt;.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_AUTOCR</name>
          <displayName>DAC_AUTOCR</displayName>
          <description>DAC Autonomous mode control register </description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTOMODE</name>
              <description>This bit is set and cleared by software.
0: DAC Autonomous mode disabled
1: DAC Autonomous mode enabled
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DAC Autonomous mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DAC Autonomous mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
