ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U366.svd
        <register>
          <name>DBGMCU_DBG_AUTH_DEVICE</name>
          <displayName>DBGMCU_DBG_AUTH_DEVICE</displayName>
          <description>DBGMCU debug device authentication register </description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>AUTH_ID</name>
              <description>Device specific ID used for RDP regression.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_PIDR4</name>
          <displayName>DBGMCU_PIDR4</displayName>
          <description>DBGMCU CoreSight peripheral identity register 4 </description>
          <addressOffset>0xFD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JEP106CON</name>
              <description>None
0x0: STMicroelectronics JEDEC code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>STMicroelectronics JEDEC code</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>None
0x0: The register file occupies a single 4-Kbyte region.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The register file occupies a single 4-Kbyte region.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_PIDR0</name>
          <displayName>DBGMCU_PIDR0</displayName>
          <description>DBGMCU CoreSight peripheral identity register 0 </description>
          <addressOffset>0xFE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>None
0x00: DBGMCU part number
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>DBGMCU part number</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_PIDR1</name>
          <displayName>DBGMCU_PIDR1</displayName>
          <description>DBGMCU CoreSight peripheral identity register 1 </description>
          <addressOffset>0xFE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTNUM</name>
              <description>None
0x0: DBGMCU part number
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DBGMCU part number</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEP106ID</name>
              <description>None
0x0: STMicroelectronics JEDEC code
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>STMicroelectronics JEDEC code</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_PIDR2</name>
          <displayName>DBGMCU_PIDR2</displayName>
          <description>DBGMCU CoreSight peripheral identity register 2 </description>
          <addressOffset>0xFE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JEP106ID</name>
              <description>None
0x2: STMicroelectronics JEDEC code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>STMicroelectronics JEDEC code</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEDEC</name>
              <description>None
0x1: designer identification specified by JEDEC
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>designer identification specified by JEDEC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVISION</name>
              <description>None
0x0: r0p0
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>r0p0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_PIDR3</name>
          <displayName>DBGMCU_PIDR3</displayName>
          <description>DBGMCU CoreSight peripheral identity register 3 </description>
          <addressOffset>0xFEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMOD</name>
              <description>None
0x0: no customer modifications
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no customer modifications</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVAND</name>
              <description>None
0x0: no metal fix
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>no metal fix</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_CIDR0</name>
          <displayName>DBGMCU_CIDR0</displayName>
          <description>DBGMCU CoreSight component identity register 0 </description>
          <addressOffset>0xFF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>None
0x0D: common identification value
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0D</name>
                  <description>common identification value</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_CIDR1</name>
          <displayName>DBGMCU_CIDR1</displayName>
          <description>DBGMCU CoreSight component identity register 1 </description>
          <addressOffset>0xFF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>None
0x0: common identification value
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>common identification value</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASS</name>
              <description>None
0xF: Non-CoreSight component
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xF</name>
                  <description>Non-CoreSight component</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_CIDR2</name>
          <displayName>DBGMCU_CIDR2</displayName>
          <description>DBGMCU CoreSight component identity register 2 </description>
          <addressOffset>0xFF8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>None
0x05: common identification value
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>common identification value</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_CIDR3</name>
          <displayName>DBGMCU_CIDR3</displayName>
          <description>DBGMCU CoreSight component identity register 3 </description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000B1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>None
0xB1: common identification value
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xB1</name>
                  <description>common identification value</description>
                  <value>177</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
